app/Controllers/user/Artikelctrl.php

    public function index()
    {
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(),
        ];
---
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_profil`