app/Models/ArtikelModel.php

    public function getArtikelTerbaru()
    {
        return $this->orderBy('id_artikel', 'desc')
            ->findAll();
---
SELECT *
FROM `tb_artikel`
ORDER BY `id_artikel` DESC